# Створіть функцію, яка на вхід отримує 2 списки цілочисельних значень,
# і повертає список унікальних значень без повтору, які є в 1 списку (немає в другому) і навпаки.

# Так як в минулому дз робив це через інструменти списків і умови, в цей раз вирішив зробити через множини.
# І так, це виявилось набагато простіше хД
a = list(input("Введіть список 1: "))
b = list(input("Введіть список 2: "))

a_set = set(a)
b_set = set(b)

c = a_set - b_set
d = b_set - a_set

print(c)
print(d)


print("New edition for new lesson")

